app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'kacharevaishnavi+2@gmail.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form', 'url']);
        $model = new UserModel();

        if ($this->request->getMethod() == 'POST') {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[8]',
            ];

            if ($this->validate($rules)) {
                $user = $model->where('email', $this->request->getVar('email'))->first();