app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `user_type` = 'Dealer'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `user_type` = 'Dealer'
---
    public function employeeDashboard()
    {
        $model = new UserModel();

        // Fetch dealers with pagination
        $data['dealers'] = $model->where('user_type', 'Dealer')->paginate(10);

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function dealerDashboard()
    {
        $session = session();
        $model = new UserModel();
        $dealer = $model->find($session->get('id'));